{
    "Автоматизация тестирования": "Это процесс проверки программного обеспечения, который включает проведение таких основных функций и шагов теста, как запуск, инициализация, выполнение, анализ и выдача результата, автоматически посредством специализированных инструментов .",
    "TDD": "Подход разработки через тестирование (TDD) предполагает организацию автоматического тестирования посредством написания модульных, функциональных и интеграционных тестов, определяющих требования к коду перед написанием кода.",
    "BDD": "это разработка, основанная на поведении. По сути, BDD является разновидностью (расширением) TDD с той лишь разницей, что BDD-подход ориентирован на поведение сущности, которую вы тестируете (в TDD основной фокус идёт непосредственно на сам код).",
    "FEC": "Техника помехоустойчивого кодирования и декодирования, позволяющая исправлять ошибки методом упреждения.",
    "ARQ": "Метод обнаружения ошибок при передаче данных, использующий сигнал подтверждение приёма  и тайм-аут для обеспечения надёжной передачи по ненадёжным сервисам.",
    "ВИДЕОПОТОК": "Временная последовательность кадров определенного формата, закодированная в битовый поток",
    "МОДЕЛЬ": "Система, исследование которой служит средством для получения информации о другой системе; представление некоторого реального процесса, устройства или концепции.",
    "ПРОТОКОЛ": "Стандарт, описывающий правила взаимодействия функциональных блоков при передаче данных",
    "АРХИТЕКТУРА": "Структура программы или вычислительной системы, определяющая ее работу на самом высоком концептуальном уровне, включая аппаратные и программные компоненты, видимые снаружи свойства этих компонентов, отношения между ними, а также документирование системы.",
    "TCP": "Один из основных протоколов передачи данных интернета, предназначенный для управления передачей данных, с гарантией доставки и сохранения порядка следования пакетов.",
    "HTTP": "Протокол прикладного уровня передачи данных, изначально — в виде гипертекстовых документов, сейчас используется для передачи произвольных данных. ",
    "МЕДИАСЕРВЕР": "Специализированный сервер, обрабатывающий аудиовидеосигналы, медиа-потоки и файлы в соответствии с расписаниями записи",
    "HLS": "Коммуникационный протокол для потоковой передачи медиа на основе HTTP, разработанный компанией Apple как часть программного обеспечения QuickTime, Safari, OS X и iOS. В основе работы лежит принцип разбиения цельного потока на небольшие фрагменты, последовательно скачиваемые по HTTP",
    "MPEG DASH": "Технология адаптивной потоковой передачи данных, предоставляющая возможность доставки потокового мультимедиа-контента через Интернет по протоколу HTTP",
    "MSS": "Является параметром протокола TCP и определяет максимальный размер полезного блока данных в байтах для TCP-пакета (сегмента).",
    "HDS": "Технология адаптивного потокового видео от Microsoft, которая плотно интегрирована с Silverlight, с одной стороны, и IIS – с другой.",
    "RTMP": "Проприетарный протокол потоковой передачи данных, в основном используется для передачи потокового видео и аудиопотоков.",
    "Katalon Studio": "Это набор инструментов для автоматизированного тестирования веб и мобильных приложений.",
    "Selenium": "Это целый комплекс решений, содержимое которого можно объединить в один пакет для работы с различными сервисами.",
    "TestComplete": "Это автоматизированное средство тестирования, позволяющее создавать тесты для Windows приложений, web-серверов и web-страниц.",
    "iOS": "Мобильная операционная система для смартфонов, электронных планшетов, носимых проигрывателей и некоторых других устройств, разрабатываемая и выпускаемая американской компанией Apple",
    "XCUITest": "Инструмент автоматизации для black-box тестирования без обращения к коду приложения. Работает только с нативными продуктами — к сожалению, провести cross-app тесты не получится",
    "DRM": "Программные или программно-аппаратные средства, которые намеренно ограничивают либо затрудняют различные действия с данными в электронной форме копирование, модификацию, просмотр и т. п. либо позволяют отследить такие действия."
}